<template>
  <div>
    <h1>TypeScript 学习</h1>
    <hr />
    <!-- <script setup> 写法-->


    <!-- 技术类 -->
    8、拥有相关数据可视化经验，熟练使用Echarts、D3、Convas中至少一种
    9、掌握WebGL图形渲染技术，有three.js开发经验者
    优先;


    <!-- 浏览器与性能优化  -->
    熟悉HTTP协议、浏览器原理、对前端性能优化有一定理解，熟练使用多种Web调试工具，追求界面的美观和效果的展现；

    <!-- 前端模块化 工程化 -->
    对前端模块化、组件化有良好认知，能独立完成前端框架的封装和组件编写

    8、熟悉Web性能优化和移动端适配技术，能够提高网站性能和用户体验。

    对页面代码结构及前端交互性能有深入的理解，对浏览器兼容性、代码可维护性、前端性能优化等有深入研究

    <!-- 后端方向 -->
    掌握 SQL Server、MYSQL、Oracle 等的一种或多种;


    <!-- 非技术类 -->
    有良好的编程习惯、编码规范、软件测试习惯;
    具备良好的分析和解决问题的能力以及较强的自主学习能力;
    具备良好的的沟通能力和团队合作精神，能够与产品经理、UI设计师和后端工程师紧密合作完成项目开
    发；
    对用户体验、交互设计/操作流程有一定了解，能够根据业务需求提出合理的前端技术方案；

    <!-- Electron技术 -->
    7.熟悉Cesium或Three.js等3D引擎开发,具有相关项目或产品开发经验者优先。

    Cesium开发经验优先

    3.有一定的地图与三维可视化开发经验，熟悉cesium.js或three.js;

  </div>
</template>
<script lang="ts">

export default {
  setup(props) {
    let name = 'Alice';
  }
}

</script>
<style lang="scss"></style>
